hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/example/usart/clksync_polling/source/main.c
/**
 *******************************************************************************
 * @file  usart/clksync_polling/source/main.c
 * @brief This example demonstrates CLKSYNC data receive and transfer by polling.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-04-28       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <string.h>
#include "hc32_ddl.h"

/**
 * @addtogroup HC32F120_DDL_Examples
 * @{
 */

/**
 * @addtogroup CLKSYNC_Polling
 * @{
 */

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/* Key Port/Pin definition */
#define KEY_PORT                        GPIO_PORT_7
#define KEY_PIN                         GPIO_PIN_0

/* Red LED Port/Pin definition */
#define LED_R_PORT                      GPIO_PORT_2
#define LED_R_PIN                       GPIO_PIN_5
#define LED_R_ON()                      GPIO_ResetPins(LED_R_PORT, LED_R_PIN)

/* Green LED Port/Pin definition */
#define LED_G_PORT                      GPIO_PORT_2
#define LED_G_PIN                       GPIO_PIN_6
#define LED_G_ON()                      GPIO_ResetPins(LED_G_PORT, LED_G_PIN)

/* CLKSYNC CK/RX/TX Port/Pin definition */
#define CLKSYNC_CK_PORT                 GPIO_PORT_3
#define CLKSYNC_CK_PIN                  GPIO_PIN_0      /* P30: USART2_CK_A */

#define CLKSYNC_RX_PORT                 GPIO_PORT_0
#define CLKSYNC_RX_PIN                  GPIO_PIN_1      /* P01: USART2_RX_B */

#define CLKSYNC_TX_PORT                 GPIO_PORT_0
#define CLKSYNC_TX_PIN                  GPIO_PIN_0      /* P00: USART2_TX_B */

/* USART unit definition */
#define CLKSYNC_UNIT                    M0P_USART2

/* Function clock gate definition  */
#define FUNCTION_CLK_GATE               CLK_FCG_UART2

/* Timeout max definition  */
#define TIMEOUT_MAX                     0xFFFFFFFFU

/* Size of Reception buffer */
#define RX_BUF_SIZE                     (ARRAY_SZ(m_u8TxBuffer))

/* CLKSYNC device mode definition */
#define CLKSYNC_MASTER_MODE             (0u)
#define CLKSYNC_SLAVE_MODE              (1u)

/* USART master or slave mode selection */
#define CLKSYNC_DEVICE_MODE             CLKSYNC_MASTER_MODE

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void LedConfig(void);
static void SystemClockConfig(void);
static en_result_t USART_WaitOnFlagUntilTimeout(M0P_USART_TypeDef *USARTx,
                                                uint32_t u32Flag,
                                                en_flag_status_t enStatus,
                                                uint32_t u32TickStart,
                                                uint32_t u32Timeout);
static en_result_t CLKSYNC_TransmitReceive(M0P_USART_TypeDef *USARTx,
                                           uint8_t *pu8TxData,
                                           uint8_t *pu8RxData,
                                           uint32_t u32Size,
                                           uint32_t u32Timeout);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static stc_clksync_init_t m_stcClksyncInit;

/* Buffer used for transmission */
static uint8_t m_u8TxBuffer[] = "CLKSYNC TX/RX example: Communication between two boards using usart interface!";

/* Buffer used for reception */
static uint8_t m_u8RxBuffer[RX_BUF_SIZE];

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @brief  Configure RGB LED.
 * @param  None
 * @retval None
 */
static void LedConfig(void)
{
    stc_gpio_init_t stcGpioInit = {0};

    stcGpioInit.u16PinMode = PIN_MODE_OUT;
    stcGpioInit.u16PinState = PIN_STATE_SET;
    GPIO_Init(LED_G_PORT, (LED_G_PIN | LED_R_PIN), &stcGpioInit);
}

/**
 * @brief  Configure system clock.
 * @param  None
 * @retval None
 */
static void SystemClockConfig(void)
{
    stc_clk_xtal_init_t stcXTALInit;

    /* Initialize XTAL clock */
    stcXTALInit.u8XtalState = CLK_XTAL_ON;
    stcXTALInit.u8XtalMode = CLK_XTALMODE_OSC;
    stcXTALInit.u8XtalDrv = CLK_XTALDRV_HIGH;
    stcXTALInit.u8XtalSupDrv = CLK_XTAL_SUPDRV_OFF;
    stcXTALInit.u8XtalStb = CLK_XTALSTB_8;
    CLK_XTALInit(&stcXTALInit);

    /* Switch system clock from HRC(default) to XTAL */
    CLK_SetSysclkSrc(CLK_SYSCLKSOURCE_XTAL);
}

/**
 * @brief  This function handles USART Communication Timeout.
 * @param  [in] USARTx                  pointer to a USART instance.
 * @param  [in] u32Flag                 specifies the USART flag to check.
 * @param  [in] enStatus                The new Flag status (Set or Reset).
 * @param  [in] u32TickStart            Tick start value.
 * @param  [in] u32Timeout              Timeout duration.
 * @retval An en_result_t enumeration value:
 *           - Ok: success
 *           - ErrorTimeout: timeout
 */
static en_result_t USART_WaitOnFlagUntilTimeout(M0P_USART_TypeDef *USARTx,
                                                uint32_t u32Flag,
                                                en_flag_status_t enStatus,
                                                uint32_t u32TickStart,
                                                uint32_t u32Timeout)
{
    /* Wait until flag is set */
    while((USART_GetFlag(USARTx, u32Flag) ? Set : Reset) == enStatus)
    {
        /* Check for the Timeout */
        if (u32Timeout != TIMEOUT_MAX)
        {
            if ((u32Timeout == 0U) || ((SysTick_GetTick() - u32TickStart) > u32Timeout))
            {
                return ErrorTimeout;
            }
        }
    }

    return Ok;
}

/**
 * @brief  Send && receive an amount of data in full-duplex mode (blocking mode).
 * @param  [in] USARTx                  Pointer to a USART instance.
 * @param  [in] pu8TxData               Pointer to data transmitted buffer
 * @param  [out] pu8RxData              Pointer to data received buffer
 * @param  [in] u32Size                 Amount of data to be sent
 * @param  [in] u32Timeout              Timeout duration
 * @retval An en_result_t enumeration value:
 *           - Ok: success
 *           - ErrorInvalidParameter: USARTx/pu8TxData/pu8RxData/u16Size is invalid
 */
static en_result_t CLKSYNC_TransmitReceive(M0P_USART_TypeDef *USARTx,
                                           uint8_t *pu8TxData,
                                           uint8_t *pu8RxData,
                                           uint32_t u32Size,
                                           uint32_t u32Timeout)
{
    uint32_t u32Flag;
    uint32_t u32TickStart = 0U;
    uint32_t u32XferCount = u32Size;

    if((USARTx == NULL) || (pu8TxData == NULL) || (pu8RxData == NULL) || (u32Size == 0U))
    {
        return ErrorInvalidParameter;
    }

    /* Init tickstart for timeout managment */
    u32TickStart = SysTick_GetTick();

    /* Check the remain data to be received */
    while (u32XferCount > 0U)
    {
        u32XferCount--;

        /* Wait for TX empty or TX complete flag in order to write data in DR */
        u32Flag = (USART_INTCLK_OUTPUT == USART_GetClockMode(USARTx)) ? USART_FLAG_TC : USART_FLAG_TXE;
        if (USART_WaitOnFlagUntilTimeout(USARTx, u32Flag, Reset, u32TickStart, u32Timeout) != Ok)
        {
            return ErrorTimeout;
        }

        USART_SendData(USARTx, *pu8TxData++);

        /* Wait for RXNE Flag */
        if (USART_WaitOnFlagUntilTimeout(USARTx, USART_FLAG_RXNE, Reset, u32TickStart, u32Timeout) != Ok)
        {
            return ErrorTimeout;
        }

        /* Receive data */
        *pu8RxData++ = (uint8_t)USART_RecData(USARTx);
    }

    return Ok;
}

/**
 * @brief  Main function of CLKSYNC polling project
 * @param  None
 * @retval int32_t return value, if needed
 */
int32_t main(void)
{
    /* Configure system clock. */
    SystemClockConfig();

    /* Configure system tick. */
    SysTick_Init(100);

    /* Configure LED pin. */
    LedConfig();

    /* Configure USART RX/TX pin. */
    GPIO_SetFunc(CLKSYNC_CK_PORT, CLKSYNC_CK_PIN, GPIO_FUNC_USART);
    GPIO_SetFunc(CLKSYNC_RX_PORT, CLKSYNC_RX_PIN, GPIO_FUNC_USART);
    GPIO_SetFunc(CLKSYNC_TX_PORT, CLKSYNC_TX_PIN, GPIO_FUNC_USART);

    /* Enable peripheral clock */
    CLK_FcgPeriphClockCmd(FUNCTION_CLK_GATE, Enable);

    /* Initialize CLKSYNC function. */
    m_stcClksyncInit.u32Baudrate = 38400;
    m_stcClksyncInit.u32BitDirection = USART_LSB;
    m_stcClksyncInit.u32ClkMode = (CLKSYNC_DEVICE_MODE == CLKSYNC_MASTER_MODE) ? USART_INTCLK_OUTPUT : USART_EXTCLK;
    USART_ClkSyncInit(CLKSYNC_UNIT, &m_stcClksyncInit);

    /* Enable RX/TX function */
    USART_FuncCmd(CLKSYNC_UNIT, (USART_RX | USART_TX), Enable);

    /* User key : SW2 */
    while (Pin_Reset != GPIO_ReadInputPortPin(KEY_PORT, KEY_PIN))
    {
    }

    /* Start the transmission process*/
    CLKSYNC_TransmitReceive(CLKSYNC_UNIT, m_u8TxBuffer, m_u8RxBuffer, RX_BUF_SIZE, TIMEOUT_MAX);

    /* Compare m_u8TxBuffer and m_u8RxBuffer data */
    if (memcmp(m_u8TxBuffer, m_u8RxBuffer, RX_BUF_SIZE) == 0)
    {
        LED_G_ON();
    }
    else
    {
        LED_R_ON();
    }

    while (1)
    {
    }
}

/**
 * @brief  systick callback function
 * @param  [in]  None
 * @retval None
 *
 */
void SysTick_IrqHandler(void)
{
    SysTick_IncTick();
}

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
